Lid_Driven_Cavity_OpenFoam/cavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    topBoundary
    {
        type            wall;
        inGroups        1(wall);
        nFaces          258;
        startFace       132612;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          774;
        startFace       132870;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          133128;
        startFace       133644;
    }
)

// ************************************************************************* //
